---
kind: method
id: M:Autodesk.Revit.UI.Macros.ApplicationEntryPoint.GetRibbonPanels
source: html/3abcb2a7-e687-0d30-f0c4-bff2f57276de.htm
---
# Autodesk.Revit.UI.Macros.ApplicationEntryPoint.GetRibbonPanels Method

## Syntax (C#)
```csharp
public override List<RibbonPanel> GetRibbonPanels()
```